Importing the Packages

In [61]:
import  pandas as pd
import numpy as np

Importing the Data

In [62]:
raw_csv_data = pd.read_csv("data/Index2018.csv")
df_comp = raw_csv_data.copy()

Length of the Time Period

In [63]:
# El campo date es un string, y hay que convertirlo a datetime para trabajar con el
df_comp.dtypes

date       object
spx       float64
dax       float64
ftse      float64
nikkei    float64
dtype: object

In [64]:
df_comp.date.head(5)

0    07/01/1994
1    10/01/1994
2    11/01/1994
3    12/01/1994
4    13/01/1994
Name: date, dtype: object

In [65]:
# Como los campos de date son string, tiene un valor de 1
# Entonces, top devuelve un valor aleatorio, por tanto tenemos 
# que arreglar esto
df_comp.date.describe()

count           6269
unique          6269
top       07/01/1994
freq               1
Name: date, dtype: object

From Text to datetime

In [66]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True)
df_comp.date.head(3)

0   1994-01-07
1   1994-01-10
2   1994-01-11
Name: date, dtype: datetime64[ns]

In [67]:
df_comp.date.describe()

count                             6269
mean     2006-01-14 19:36:59.492742144
min                1994-01-07 00:00:00
25%                2000-01-11 00:00:00
50%                2006-01-12 00:00:00
75%                2012-01-19 00:00:00
max                2018-01-29 00:00:00
Name: date, dtype: object

Setting the Index

In [68]:
df_comp.set_index("date", inplace= True)

In [69]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

Setting the Desired Frequency

In [70]:
# asfreq puede recibir como argumento:
# "h" -> hourly
# "w" -> week
# "d" -> day
# "m" -> monthly
# 'a' -> annual en vez de y de year
df_comp = df_comp.asfreq('d')

In [71]:
df_comp.head(5)

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

Closing prices of financial indices.
<br>
Can only be recorded during working days.
<br>
Not interested in any weekends or holidays

asfreq() también acepta el argumento 'b' -> business days
<br>
el cuál descarta los fines de semana

In [72]:
df_comp = df_comp.asfreq('b')
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

Handling Missing Values

In [73]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [74]:
# Anteriormente no teniamos datos faltante y ahora luego
# Agregar la frequencia tenemos 8
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

Métodos para manejar datos faltantes: 
<br>
    1 - Front filling: Assigns the value of the previos period.
    <br>
    2 - Back filling: Assigns the value of the next period.
    <br>
    3 - Assigning the same value : Assign the average to all the missing values within the time-series (bad approach)

In [75]:
df_comp.spx = df_comp.spx.ffill()
df_comp.spx.isna().sum()

np.int64(0)

In [76]:
df_comp.ftse = df_comp.ftse.fill()
df_comp.ftse.isna().sum()

np.int64(0)

In [77]:
df_comp.dax = df_comp.dax.fillna(value = df_comp.dax.mean())

In [79]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [81]:
df_comp.nikkei = df_comp.nikkei.bfill()
df_comp.nikkei.isna().sum()

np.int64(0)

Simplifying the Dataset

In [84]:
# Vamos a estar analizando S&P500 por tanto no nos interesa las otras características
# Razones para remover las columnas FTSE, DAX and NIKKEI
# 1 - The less data we load, the faster we can manipulate it.
# 2 - Clarity. Easier to keep track of the dataset

In [85]:
df_comp["market_value"] = df_comp.spx

In [87]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.597179   1288.642547
std     487.868210   2752.604984  1145.568370   4043.683038    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10701.130000    992.715221
50%    1233.761241   5774.380000  5663.300000  15030.510000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [89]:
del df_comp["spx"], df_comp["dax"], df_comp["ftse"], df_comp["nikkei"]

In [90]:
df_comp

            market_value
date
1994-01-07    469.900000
1994-01-10    475.270000
1994-01-11    474.130000
1994-01-12    474.170000
1994-01-13    472.470000
...                  ...
2018-01-23   2839.130362
2018-01-24   2837.544008
2018-01-25   2839.253031
2018-01-26   2872.867839
2018-01-29   2853.528411

[6277 rows x 1 columns]

# Splitting the Data

We need to split our data into 2 sets:
<br>
    1. - Training Set
    <br>
    2. - Testing Set

No se puede barajear los datos en Time Series por la cronologia de los datos.
<br>
Training set: From the begining up to some but off point
<br>
Testing set: From the cut off point until the end

In [91]:
# The name iloc comes from index location
# The name "len" comes from length

In [92]:
size = int(len(df_comp) * 0.8)

In [93]:
# Conjunto de entrenamiento
df = df_comp[:size]

In [94]:
# Conjunto de prueba
df_test = df_comp[size:]

Revisando que no los datos no estén solapados

In [95]:
df.tail(5)

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [97]:
df_test.head(5)

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623